Title: Nope Body: Nope
Title: A subscription plan is an instant turnoff! Body: Why does it have to be a subscription plan? Why can’t I just make a one time payment?! 
Deleted the app right away!
Title: About to try this 😁 Body: Some of the comments are  deep as in make you want to instantly get the app…… so I’m getting the app lol lll come bk to rate soon😁
Title: Misleading promotion Body: It gave me the option to share app to get additional 7 days of free trial it sent link to my wife then gave error that code could not be used. Then I sent the invite through the app and it gave a different code and said she had already accepted it but it did not give either one of us the additional 7 days will not use an app that has already had issue within minutes of using

Terrible customer support!!! When you send a share promotion to someone it states that they get 7 days and your trial will go to 14 days plus I was sent an email for a 14 day trial and that did not work either.
Title: Amazing 🥲 Body: I’m in love! ❤️ Others say it so much more eloquently then myself but this is a supreme app.  One can easily get what they need for free on you tube but I  enjoy knowing I subscribe and help this team because they help me so much each week! Thanks 🙏🏼 Endel
Title: amazing Body: 💓💓💓💓💓🦋🙌🏻🦋🙏🙏🙏
Title: wow! others are good; this is Neo Body: very important to me to get a good pair of headphones on, get in my sanctuary and get focused. work-saving, business-saving, career-saving, sanity-saving and maybe life-saving app. ¯\_(ツ)_/¯ at the very, very least, this makes work better, showers better (with a water-proof speaker or audiobooks better (w background mode on Endel enabled).
Title: Best sleep app Body: I was not able to sleep but then I got Endel and now I sleep and feel refreshed in the morning so thank you Endel!
Title: A BLESSED REVIEW Body: IT WAS ENTIRELY BLESSED, THE BEAUTIFUL LANDSCAPE OF THIS APP TRULY DETAILS THE OUTLINE’S OF MEDITATION
Title: Sorry Body: I thought it would be more relaxing. Too many fast beats. The sounds become annoying.
Fast beats and startling sounds, ie: repeated sharp sound of chimes and bells. Volume changes with introduction of these beating sounds.
I was three day late in canceling the subscription.
Would you excuse the three days and allow me to receive a refund??
Title: The Best App of 2022 Body: I’ve been on the search for the perfect playlist to study, work and exercise. This is the best music app on thr market. The transitions between the songs and playlist are so seamless you don’t even notice them. The song really keep me focus and calm.  I use the app throughout the entire day
Title: Cure for my ADHD Body: Thank you! I feel more productive and relaxed and my mind is not scattered anymore. 🔥❤️
Title: What happened to my free trial? Body: I agreed to a free trial on 12/15/22 and was charged a monthly premium on 12/16/22. I should not have been charged until the free trial ends. Please refund me. I have canceled the subscription.
Title: Becoming too conplicated Body: I’m not a fan of how many messages we have to dismiss just to get to the new, very confusing and hard to navigate Home Screen. I eventually end up finding what I need, but I want to adjust these things at a glance, not navigating through an endless maze of menus and options.
Title: This App is Epic!!! Body: I woke up, at 3: 50 am, and made my daily aspirations; then I opened the Endel app. The lush and melodious, dynamic sounds this app provides coupled with conscious respiration kept me grounded and tranquil, all morning. I was out of the bed by 4: 20 am and ready to have some tea meditation. I slowly began to become more lucid to the sounds as they morphed into the twilight phase: the natural sound of an owl blended beautifully with the acoustics and other melodies woven into the featured hibernation sound track.

Later in the morning, during walking meditation, the sounds changed based upon the pace of my steps, and it put me in a Flow state. This is definitely one of the best apps you can have on a smart phone. Thank you Endel team for an amazing experience accessible 24/7 via my iPhone. 

😊
Title: Horrible Body: Customer service is awful. I wrote in to assist me with an issue and they completely failed to do so. Their response was so inappropriate and condescending. I’m appalled that a business that promotes well being treats their listeners with so much disrespect. The music all sounds the same and the app is hard to operate. The choices are an endless stream of the same dark and depressing music. I would not recommend this app to anyone looking to improve their mental health. My experience with the staff was so frustrating and stressful. Surely not the experience I’d expect from a mental wellness team. The music is ineffective to put me in a state of mind where I am calmer. The sounds are irritating and the production quality is poor. Sounds like someone is running this operation out of their basement. DON’T SUBSCRIBE to this. It’s a waste of money and I can assure you the people behind this app are complete frauds.
Title: Liked it at first Body: I looked forward to using this for sleep and it did not disappoint - the tones, pace, and volume transition as you drift off and awaken you gradually in the morning. i slept well for several weeks until one night when I had the scariest dream I’ve ever had - I woke up and the app was playing tones i hadn’t heard before - i can only describe them as ominous and dread-inducing. I can only guess that the tones caused the dream, as I’m not prone to nightmares, and it was so disturbing and awful that I’ve avoided using the app since that night.
Title: 👎🏽 Body: You know what stresses me out…subscriptions. But hey, everybody has to make money somehow. I’m good ✌🏽
Title: Dangerous Body: After using this program for a week or so I began to feel anxious and depressed.I stopped using it and I immediately felt better. It would not surprise me if this made some people suicidal
Title: That's a big change... Body: Was considering a subscription, but suddenly it went from $59 all the way up to $89..?
Title: Next level Body: These tailored to me binaural stereo sounds are 100 percent changing and improving my life. I wish more people had the right earbuds. Requires excellent stereo audio but that’s achievable. I really wish people believed me when I tell them this is so good for us. If you embed this in brains, sign me up. Our brains expand xo thank you guys
Title: Defeats the purpose Body: The stupid in app purchases defeat the purpose and the mission. It is scummy to say oh everyone is suffering we need a solution, and then force people to pay to get the benefits. Moreover its annual payment. Worst, i never know whether i accidentally paid for it or not. It racks up anxiety. By the way, almost every app has this problem. Stoic for example. I would instead strongly suggest a voluntary donate option
Title: Is it chanting ? Body: I heard some monks chanting in the sleep session…is it chanting?
Title: Outstanding App! Body: This app is free to try and the options on this app are variety enough to get you through everyday life. The relax feature helps ease nausea and anxiety. Focus helps with cleaning and such. Please try because if you don’t like it you can just delete it. :) have a blessed day.
Title: Like having Brian Eno in your head Body: Imagine.
Title: Absolute scam Body: This looked interesting so I decided to do the free trial.  I had to input my credit card info, which I understand. But it charged me for a month IMMEDIATELY.  What ever happened to my free trial?  Please tell me how to get a refund.  This is unfair and dishonest. F-
Title: I like the research that went into it Body: However, it’s not for me. I found the sounds annoying. It could just be my natural rhythm that didn’t align. I did the trial and forgot to cancel and billed for the whole year. I didn’t request a refund since I wanted to see if I needed to get used to it. After a few months, I still didn’t find the sounds/app to do it’s intention. Research went into developing the app so I didn’t mind the charge. Also, it kept saying I was using the app through notifications but I never opened the app. So I deleted the app. That way it doesn’t send false information saying the app was being used but it wasn’t.
Title: Misleading paywall Body: Thanks for charging me $59 for a free trial; now I’ve gotta wait up to 30 days for a refund during hard times!
Title: Amazing Body: My oldest daughter has schizophrenia and this app helps her so much. She asks for it when she is overwhelmed and non functional. Thank you so much.
Title: Disrupts sleep with notifications Body: The soundscapes are weirdly depressing, but the sleep sounds seemed useful. After using the app for a couple of weeks where I woke up several times in the middle of the night, I finally discovered that the problem was Endel: if I leave it go all night, the sound wakes me up after about 3 hours of sleep, but when i set it to end after 45 min, Endel dings (akin to the bell at the end of a meditation session) when it turns off, which wakes me up. This is bizarre! Why would you lull someone to sleep then turn the sound off with a bell that wakes them up?
Title: Don’t try the free trial! Body: Once you answer a few questions it asks if you want to pay for one month or one year. You can enable a toggle to try it free for a one week trial. If you do that, it still charges you the full amount. While I’m not sure if it’s intentional, it comes across as “help we’re desperate”. Uninstalling immediately.
Title: Charged early Body: I was charged a day early
Title: Beautiful soundscapes Body: I’ve used Endel to study, relax, meditate, and sometimes just as background music. Great experience and a lot more potential with AI-generated music.
Title: Cash grab. Body: I used to use the free sound track for my child. They’ve now blocked literally everything behind a paywall until you spend your salary on a sound app. Go use MyNoise, amazing quality - thank me later!
PS, their fluctuating volume is atrocious. You set it to sleep all night, and sometimes it’s so low you can hardly hear it on full volume, and other times it amps up this hissing white noise or tune that’s EXTREMELY loud for 3am. Just ridiculous.
Title: No help, no sleep Body: So basically I’m a minor and when I first discovered I was like “better sleep, finally” nope not the right if you don’t know what is sleeping sound is here it is: non threatening, lower heart rate and relax breathing well from me, when I was going to sleep and I felt non-relaxed breathing and intense heartbeat yeah I felt my heart doing big heavy pounds every time I layed down and listened to this.
Title: This works EXTREMELY well Body: I have been using it for a few weeks now, my best friend bought me a subscription for it because I wouldn’t stop talking about it… focus at work, chill at home, breathing through stressful moments, & sleep with the stars at the end of the day… I cannot give this application more thumbs up… well done folks
Title: Excellent with minor issues Body: The app itself is excellent and I have been using it for more than a year. The UI has gotten more and more complicated of late making it harder to use. The old UI was a lot cleaner. Also the widget seems to be broken since it just appears blank. It opens the app if you tap on it though. Update: Just updated to iOS 16 and the Lock Screen with Endel playing is hideous. It displays a giant pixelated image.

Update: The widget and Lock Screen are both fixed. Thanks for the responsiveness!
Title: Endless soundscapes? Body: Everytime i put it on sleep its the same exact sound. Idk i guess i misinterpreted “endless”. Kind of mad i paid for this, couldve just used any music app.
Title: Free trial is a lie! Body: I decided to try out this app since it has a free trial. I started the trial last night and was charged for the first month of $9.99 last night. I requested a refund from Apple and am waiting. Be warned.
Title: Cool idea, overpriced and under delivered Body: I like the idea of this app, provide a soundscape to help at the moments of life when you need a nudge to focus or relax or wake up. For the first day or two I thought this app was great, but after a few days it gets really old basically listening to the same 8 measures of tones on repeat. As a ten dollar a month subscription I would expect muuuuch more diversity in the sounds and music it plays, but as it is, it is like having three or four very similar sounding thirty second songs on repeat. This is a hard pass from me until they can find a way to get some more aural diversity.
Title: Recently resubscribed and forgot how much I love it! Body: I’m used to finding hz music to listen at work and I tend to run out of options. Endel fits so perfectly into what I need to hear and while I’m still trying to understand how to use the app, I fell right to sleep last night. Playing it while I type this, it’s already helping my body relax and ground. I paid for a year this time as I don’t want to be without. Thank you!
Title: Notifications are allowed through Body: Great app but its letting notifications go through when I’m in sleep mode
Wide awake now!
Title: HIDDEN CHARGES Body: Doesn’t show any “In-App” Purchases on App Face, however when you Browse through the App a Subscription Price pops up.  This is called: FALSE ADVERTISING.!!! All Apps that have Purchases are Required to Show it on the Face Screen.
Title: DO NOT PURCHASE RIP OFF!!!!!!! Body: Watch out!!! I was charged 59.00 for looking at this app for 30 minutes. I notified PayPal. PayPal was told by these people they would refund me. I have not been refunded my 59.00. I can’t do it through Apple even though the charge went through and I have purchased the app, even though I did a 7 day trial. I cannot get a refund. I have wrote the developers 30 minutes after I looked at this app and explained everything, absolutely NO ONE HAS DONE ANYTHING TO HELP ME!!!!!! DO NOT PURCHASE UNLESS YOU WANT THE SAME TROUBLES!!!!!!!
Title: During free trial, immediately was charged $10 Body: Jeez... Count even wait the 7 days... Calling tmmrw for a refund
Title: Perfect for someone with severe sensory issues Body: I get easily overloaded and this is the perfect app to keep on constantly in the background to help me not feel overwhelmed. The autoplay feature isn't that (calibrated?) good, but I love to leave the relax on.

I can still focus on what’s going on around me with Endel on in the background, yet remain calm. Thank you, Endel team! Life is a lot better without anxiety attacks.
Title: It’s okay Body: I don’t dislike the app, and I did enjoy using it. However, my takeaway is this is primarily a collection of ambient music/ soubdscapes coupled with a pretty and visually pleasing graphics. I don't know if this app constitutes as AI. More likely at best it may read your health info and do “if-then” logic. That doesn't seem to me like real AI, actual learning intelligence. More like the app reads a set of variables such as time of day, heart rate, etc. Then running a routine  determines what to play outlined by a group of instructions. Would I pay $50+ a year? No! Would I pay $25 ? Maybe. But like many others I am sick of all the subscriptions.  I do believe an individual can create similair curated playlists with Apple Music, or most other music subscription services. The advantage here the app is doing much if the curating.
Title: Frustrated by annual auto renewal Body: Frustrated that I was auto renewed at the annual rate after ending my free trial and deleting the app, apparently I missed the cutoff by minutes but no path to resolution through apple
Title: Like this Body: Hate using apps for anxiety, just gives me more anxiety. But when waiting at doctors or somewhere stressful this thing is amazing at holding my attention and settling.
Title: iOS 16 began to overheating the phone Body: Please work on the fix